Repository: BosonaGosaye/weather
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: BSG Weather
am: BSG የአየር ሁኔታ

source: Search
am: ፈልግ

source: My Location
am: የእኔ መገኛ

source: Feels Like
am: ስሜት

source: Humidity
am: እርጥበት

source: Wind
am: ንፋስ

# windUnit
source: km/h
am: ኪ.ሜ/ሰ

source: Pressure
am: ግፊት

source: Hourly Forecast
am: የሰዓት ትንበያ

source: Settings
am: ቅንብሮች

source: Language
am: ቋንቋ

source: Theme
am: ገጽታ

source: Light
am: ቀላል

source: Dark
am: ጨለማ

source: System
am: ስርዓት

# searchPlaceholder
source: Search for a city or use your location
am: ከተማ ይፈልጉ ወይም መገኛዎን ይጠቀሙ

source: Error
am: ስህተት

source: Retry
am: እንደገና ሞክር

source: Toggle Theme
am: ገጽታ ቀይር

source: Search City
am: ከተማ ፈልግ

source: Enter city name...
am: የከተማ ስም ያስገቡ...

source: Favorite Cities
am: ተወዳጅ ከተሞች

# noFavorites
source: No favorite cities yet.
am: ምንም ተወዳጅ ከተሞች የሉም።

source: Delete
am: ሰርዝ

# sevenDayForecast
source: 7-Day Forecast
am: የ7 ቀን ትንበያ

# pastSevenDays
source: Past 7 Days History
am: ያለፉት 7 ቀናት ታሪክ
